Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: > python setup.py --help build_ext [...] Options for 'build_ext' command: --build-lib (-b) directory for compiled extension modules --build-temp (-t) directory for temporary files (build by-products) --inplace (-i) ignore build-lib and put compiled extensions into the source directory alongside your pure Python modules --include-dirs (-I) list of directories to search for header files --define (-D) C preprocessor macros to define --undef (-U) C preprocessor macros to undefine --swig-opts list of SWIG command line options [...]
pl: > python setup.py --help build_ext [...]Opcje dla komendy 'build_ext': --build-lib (-b) katalog dla skompilowanych modułów rozszerzeń --build-temp (-t) katalog dla plików tymczasowych (produktów ubocznych budowania) -- inplace (-i) ignoruj build-lib i umieść skompilowane rozszerzenia do katalogu źródeł obok twoich czystych modułów języka pytonowskiego --include-dirs (-I) lista katalogów do przeszukania w celu znalezienia plików nagłówkowych --define (-D) makra preprocesora do zdefiniowania --undef (-U) makra preprocesora do oddefiniowania --swig-opts lista opcji wiersza polecenia SWIG [...]

source: Note that an option spelled :option:`--foo-bar` on the command-line is spelled :option:`foo_bar` in configuration files.
pl: Zauważ, że opcja przeliterowana :option:`--foo-bar` w wierszu-polecenia jet przeliterowana :option:`foo_bar` w plikach konfiguracji.

source: For example, say you want your extensions to be built "in-place"---that is, you have an extension :mod:`pkg.ext`, and you want the compiled extension file (:file:`ext.so` on Unix, say) to be put in the same source directory as your pure Python modules :mod:`pkg.mod1` and :mod:`pkg.mod2`. You can always use the :option:`--inplace` option on the command-line to ensure this::
pl: Dla przykładu, powiedzmy, że chcesz aby twoje rozszerzenia były zbudowane "w-miejscu"---to jest, masz rozszerzenie :mod:`pkg.ext`, i chcesz aby skompilowany plik rozszerzenia (:file:`ext.so` na Unix-ie, załóżmy) był umieszczony w tym samym katalogu źródłowym jak twoje czyste moduły języka pytonowskiego :mod:`pkg.mod1` i :mod:`pkg.mod2`. Możesz zawsze użyć opcji :option:`--inplace` w wierszu polecenia aby to zapewnić::

source: But this requires that you always specify the :command:`build_ext` command explicitly, and remember to provide :option:`--inplace`. An easier way is to "set and forget" this option, by encoding it in :file:`setup.cfg`, the configuration file for this distribution::
pl: Ale to wymaga abyś zawsze określał polecenie :command:`build_ext` jawnie, i pamiętał dostarczyć :option:`--inplace`. Łatwiejszym sposobem jest "ustawić i zapomnieć" tą opcję, przez zakodowanie jej w pliku :file:`setup.cfg`, pliku konfiguracyjnego dla tej dystrybucji::

source: This will affect all builds of this module distribution, whether or not you explicitly specify :command:`build_ext`. If you include :file:`setup.cfg` in your source distribution, it will also affect end-user builds---which is probably a bad idea for this option, since always building extensions in-place would break installation of the module distribution. In certain peculiar cases, though, modules are built right in their installation directory, so this is conceivably a useful ability. (Distributing extensions that expect to be built in their installation directory is almost always a bad idea, though.)
pl: To wpłynie na to, że wszystkie budowy dystrybucji tego modułu, niezależnie od tego czy jawnie wyszczególnisz komendę :command:`build_ext`. Jeśli zawrzesz plik :file:`setup.cfg` w twojej dystrybucji źródłowej, wpłynie ona także na budowy dystrybucji użytkownika końcowego---co jest prawdopodobnie złym pomysłem dla tej opcji, skoro budowanie rozszerzeń w -miejscu powodowałoby zawsze uszkodzenie instalacji dystrybucji modułu. W niektórych szczególnych przypadkach, jednakże, moduły są budowane w katalogu ich instalacji, więc jest to twórczo użyteczna umiejętność. (Rozprowadzanie rozszerzeń od których oczekuje się, że będą budowane w katalogu ich instalacji jest prawie zawsze jednak złym pomysłem.)

source: Another example: certain commands take a lot of options that don't change from run to run; for example, :command:`bdist_rpm` needs to know everything required to generate a "spec" file for creating an RPM distribution. Some of this information comes from the setup script, and some is automatically generated by the Distutils (such as the list of files installed). But some of it has to be supplied as options to :command:`bdist_rpm`, which would be very tedious to do on the command-line for every run. Hence, here is a snippet from the Distutils' own :file:`setup.cfg`::
pl: Inny przykład: niektóre komendy biorą mnóstwo opcji które nie zmieniają się z wykonania na wykonanie; na przykład, polecenie :command:`bdist_rpm` potrzebuje wiedzieć wszystko, co jest wymagane do wygenerowania pliku "spec" dla utworzenia dystrybucji RPM. Niektóre z tych informacji pochodzą ze skryptu instalacyjnego, a część jest automatycznie generowana przez Distutils (takie jak lista plików zainstalowanych). Ale część z tego musi być dostarczona jako opcje do polecenia :command:`bdist_rpm`, co byłoby bardzo żmudne do wykonania z wiersza poleceń przy każdym uruchomieniu skryptu. Zatem tu jest urywek z własnego dla Distutils pliku :file:`setup.cfg`::

source: Note that the :option:`doc_files` option is simply a whitespace-separated string split across multiple lines for readability.
pl: Zauważ że opcja :options:`doc_files` jest po prostu separowanym-białymi-znakami ciągiem znaków podzielonym na kilka linii dla czytelności.

source: See also
pl: Zobacz także

source: More information on the configuration files is available in the manual for system administrators.
pl: Więcej informacji o plikach konfiguracyjnych jest dostępnych w podręczniku dla administratorów systemu.

source: Footnotes
pl: Uwagi końcowe

source: This ideal probably won't be achieved until auto-configuration is fully supported by the Distutils.
pl: Ten ideał prawdopodobnie nie zostanie osiągnięty dopóki auto-konfiguracja nie będzie w pełni wspierana przez Distutils.

source: Examples
pl: Przykłady

source: This chapter provides a number of basic examples to help get started with distutils. Additional information about using distutils can be found in the Distutils Cookbook.
pl: Ten rozdział dostarcza pewną liczbę podstawowych przykładów mających pomóc zacząć pracę z distutils. Dodatkowe informacje o użyciu distutils można znaleźć w książce kucharskiej Distutils.

source: Collection of recipes showing how to achieve more control over distutils.
pl: Kolekcja przepisów pokazujących jak osiągnąć większą kontrolę ponad distutils.

source: Pure Python distribution (by module)
pl: Czysta dystrybucja języka pytonowskiego (po modułach)

source: If you're just distributing a couple of modules, especially if they don't live in a particular package, you can specify them individually using the :option:`py_modules` option in the setup script.
pl: Jeśli rozprowadzasz kilka modułów, szczególnie jeśli one nie żyją w szczególnym pakiecie, możesz określić je indywidualnie używając opcji :option:`py_modules` w skrypcie instalacyjnym.

source: In the simplest case, you'll have two files to worry about: a setup script and the single module you're distributing, :file:`foo.py` in this example::
pl: W najprostszym przypadku, będziesz miał dwa pliki o które będziesz się musiał martwić: skrypt instalacyjny i pojedynczy moduł który rozprowadzasz, plik :file:`foo.py` w tym przypadku::

source: (In all diagrams in this section, *<root>* will refer to the distribution root directory.) A minimal setup script to describe this situation would be::
pl: (We wszystkich diagramach w tym rozdziale, *<root>* odnosił się będzie do katalogu głównego dystrybucji.) Minimalny plik skryptu instalacyjnego opisujący tę sytuację byłby::

source: Note that the name of the distribution is specified independently with the :option:`name` option, and there's no rule that says it has to be the same as the name of the sole module in the distribution (although that's probably a good convention to follow). However, the distribution name is used to generate filenames, so you should stick to letters, digits, underscores, and hyphens.
pl: Zauważ też, że nazwa dystrybucji jest określona niezależnie z opcją :option:`name`, i nie ma reguły, która mówiłaby że musi być taki sam jak nazwa samego modułu w dystrybucji (chociaż to prawdopodobnie dobra konwencja której można się trzymać). Jednakże, nazwa dystrybucji jest używana do generowania nazw plików, więc powinieneś trzymać się liter, cyfr, podkreślnika i myślników.

source: Since :option:`py_modules` is a list, you can of course specify multiple modules, eg. if you're distributing modules :mod:`foo` and :mod:`bar`, your setup might look like this::
pl: Odkąd opcja :option:`py_modules` jest listą, możesz oczywiście określić wiele modułów, np. jeśli rozprowadzasz moduły :mod:`foo` i :mod:`bar`, twój skrypt instalacyjny mógłby wyglądać następująco::

source: and the setup script might be ::
pl: i skrypt instalacyjny mógłby być::

source: You can put module source files into another directory, but if you have enough modules to do that, it's probably easier to specify modules by package rather than listing them individually.
pl: Możesz umieścić pliki źródłowe do innego katalogu, ale jeśli masz dość modułów aby to zrobić, prawdopodobnie jest łatwiej określić moduły przez nazwę pakietu zamiast wypisywać je pojedynczo.

source: Pure Python distribution (by package)
pl: Czysta dystrybucja języka pytonowskiego (przez pakiet)

source: If you have more than a couple of modules to distribute, especially if they are in multiple packages, it's probably easier to specify whole packages rather than individual modules. This works even if your modules are not in a package; you can just tell the Distutils to process modules from the root package, and that works the same as any other package (except that you don't have to have an :file:`__init__.py` file).
pl: Jeśli masz więcej niż kilka modułów do dystrybucji, szczególnie jeśli są one w kilku pakietach, pewnie łatwiej określić całe pakiety raczej niż indywidualne moduły. To działa nawet jeśli twoje moduły nie są w pakiecie; możesz powiedzieć Distutils aby przetworzył moduły z pakietu nadrzędnego, i to działa tak samo jak przy każdym innym pakiecie ( z wyjątkiem, że nie musisz mieć pliku :file:`__init__.py`)

source: The setup script from the last example could also be written as ::
pl: Skrypt instalacyjny z ostatniego przykładu mógłby także być napisany jako ::

source: (The empty string stands for the root package.)
pl: (Pusty ciąg znaków stoi zamiast nadrzędnego pakietu.)

source: If those two files are moved into a subdirectory, but remain in the root package, e.g.::
pl: Jeśli te dwa pliki są przesuwane do podkatalogu, ale znajdują się w nadrzędnym pakiecie, np.::

source: then you would still specify the root package, but you have to tell the Distutils where source files in the root package live::
pl: wtedy musiałbyś określić pakiet nadrzędny, ale musisz powiedzieć Distutils gdzie pliki źródłowe znajdują się w pakiecie nadrzędnym::

source: More typically, though, you will want to distribute multiple modules in the same package (or in sub-packages). For example, if the :mod:`foo` and :mod:`bar` modules belong in package :mod:`foobar`, one way to layout your source tree is ::
pl: Bardziej typowo, jednak, będziesz potrzebował rozprowadzić wiele modułów w tym samym pakiecie (lub pakietach podrzędnych). Na przykład: moduły :mod:`foo` i :mod:`bar` należą do pakietu :mod:`foobar`, jednym ze sposobów na rozłożenie twojego drzewa źródłowego jest::

source: This is in fact the default layout expected by the Distutils, and the one that requires the least work to describe in your setup script::
pl: To jest faktycznie domyślny układ oczekiwany przez Distutils, i jeden który wymaga najmniej pracy aby opisać w twoim pliku skryptu instalacji::

source: If you want to put modules in directories not named for their package, then you need to use the :option:`package_dir` option again. For example, if the :file:`src` directory holds modules in the :mod:`foobar` package::
pl: Jeśli chcesz umieścić moduły w katalogach nie czerpiących nazw od swoich pakietów, wtedy potrzebujesz użyć jeszcze raz opcji :option:`package_dir`. Na przykład, jeśli katalog :file:`src` trzyma moduły w pakiecie :mod:`foobar`::

source: an appropriate setup script would be ::
pl: odpowiednim skryptem instalacyjnym byłoby::

source: Or, you might put modules from your main package right in the distribution root::
pl: Lub, mógłbyś umieścić moduły z twojego głównego pakietu od razu w katalogu nadrzędnym dystrybucji::

source: in which case your setup script would be ::
pl: w przypadku czego twój skrypt instalacyjny byłby następujący::

source: (The empty string also stands for the current directory.)
pl: (Pusty ciąg znaków stoi także w miejscu obecnego katalogu.)

source: If you have sub-packages, they must be explicitly listed in :option:`packages`, but any entries in :option:`package_dir` automatically extend to sub-packages. (In other words, the Distutils does *not* scan your source tree, trying to figure out which directories correspond to Python packages by looking for :file:`__init__.py` files.) Thus, if the default layout grows a sub-package::
pl: Jeśli masz pakiety podrzędne, muszą być jawnie wypisane w opcji :option:`packages`, ale jakiekolwiek wpisy w :option:`package_dir` automatycznie rozszerzają się do pakietów podrzędnych. (Innymi słowy, Distutils *nie* skanuje twojego drzewa źródeł, próbując zgadnąć które katalogi odpowiadają pakietom języka pytonowskiego przez poszukiwanie pliku :file:`__init__.py`.) Zatem, jeśli domyślny rozkład wytwarza podrzędny pakiet::

source: then the corresponding setup script would be ::
pl: wtedy odpowiadający skrypt instalacyjny byłby ::

source: (Again, the empty string in :option:`package_dir` stands for the current directory.)
pl: (Raz jeszcze, pusty ciąg znaków w :option:`package_dir` stoi za bieżący katalog.)

source: Single extension module
pl: Pojedynczy moduł rozszerzający

source: Extension modules are specified using the :option:`ext_modules` option. :option:`package_dir` has no effect on where extension source files are found; it only affects the source for pure Python modules. The simplest case, a single extension module in a single C source file, is::
pl: Moduły rozszerzające są określane używając opcji :option:`ext_modules`. opcja :option:`package_dir` nie ma wpływu na to gdzie pliki źródłowe rozszerzenia znajdują się; ma tylko wpływ na czysto pytonowskie moduły. W najprostszym przypadku, pojedynczy moduł rozszerzający w pojedynczym pliku źródłowym C jest::

source: If the :mod:`foo` extension belongs in the root package, the setup script for this could be ::
pl: Jeśli rozszerzenie :mod:`foo` należy do głównego pakietu, skrypt instalacyjny dla tego mógłby wyglądać::

source: If the extension actually belongs in a package, say :mod:`foopkg`, then
pl: Jeśli rozszerzenie właściwie należy do pakietu, powiedzmy :mod:`foopkg`, wtedy

source: With exactly the same source tree layout, this extension can be put in the :mod:`foopkg` package simply by changing the name of the extension::
pl: Z dokładnie tym samym rozkładem drzewa źródłowego, to rozszerzenie mogłoby być umieszczone w pakiecie :mod:`foopkg` prosto przez zmianę nazwy rozszerzenia::

source: Extending Distutils
pl: Rozszerzanie Distutils

source: Distutils can be extended in various ways. Most extensions take the form of new commands or replacements for existing commands. New commands may be written to support new types of platform-specific packaging, for example, while replacements for existing commands may be made to modify details of how the command operates on a package.
pl: Distutils może być rozszerzane na różne sposoby. Większość rozszerzeń ma postać nowych komend lub zamienników istniejących komend. Nowe komendy mogą być zapisane aby wspierać nowe rodzaje szczególnych-dla-maszyny/środowiska sposobów pakowania, na przykład, podczas gdy zamienniki istniejących komend mogą być zmuszone do zmiany szczegółów tego jak komendy operują na pakiecie.

source: Most extensions of the distutils are made within :file:`setup.py` scripts that want to modify existing commands; many simply add a few file extensions that should be copied into packages in addition to :file:`.py` files as a convenience.
pl: Większość rozszerzeń distutils robionych jest w obrębie skryptów :file:`setup.py` które ustalają zmiany istniejących poleceń; wiele po prostu dodaje kilka rozszerzeń pliku, które powinny być skopiowane do pakietów w załączeniu do plików :file:`.py` jako udogodnienie.

source: Most distutils command implementations are subclasses of the :class:`Command` class from :mod:`distutils.cmd`. New commands may directly inherit from :class:`Command`, while replacements often derive from :class:`Command` indirectly, directly subclassing the command they are replacing. Commands are required to derive from :class:`Command`.
pl: Większość wypełnień programowych poleceń distutils są pochodnymi uogólnieniami uogólnienia :class:`Command` z modułu :mod:`distutils.cmd`. Nowe polecenia mogą bezpośrednio dziedziczyć z uogólnienia :class:`Command`, podczas gdy zamienniki często dziedziczą po uogólnieniu :class:`Command` pośrednio, bezpośrednio dziedzicząc po poleceniu które zamieniają. Oczekuje się, że polecenia będą dziedziczyły z uogólnienia :class:`Command`.

source: Integrating new commands
pl: Integrowanie nowych poleceń

source: There are different ways to integrate new command implementations into distutils. The most difficult is to lobby for the inclusion of the new features in distutils itself, and wait for (and require) a version of Python that provides that support. This is really hard for many reasons.
pl: Istnieją różne sposoby na integrację wypełnień programowych nowych poleceń do distutils. Najtrudniej jest jest lobbować za włączeniem nowych właściwości do samego distutils, i czekać (i wymagać) na nową wersję języka pytonowskiego która będzie dawała to wsparcie. Jest to bardzo trudne z wielu powodów.

source: The most common, and possibly the most reasonable for most needs, is to include the new implementations with your :file:`setup.py` script, and cause the :func:`distutils.core.setup` function use them::
pl: Najczęstszą i prawdopodobnie najbardziej rozsądną dla większości z potrzeb jest załączenie nowego wypełnienia programowego z twoim skryptem :file:`setup.py` i spowodowanie aby zadanie :func:`distutils.core.setup` ich użyło::

source: from distutils.command.build_py import build_py as _build_py from distutils.core import setup class build_py(_build_py): """Specialized Python source builder.""" # implement whatever needs to be different... setup(cmdclass={'build_py': build_py}, ...)
pl: from distutils.command.build_py import build_py as _build_py from distutils.core import setup class build_py(_build_py): """Wyspecjalizowane budowanie źródeł pytona.""" # wypełnij wszystko cokolwiek potrzeba aby było inne... setup(cmdclass={'build_py': build_py}, ...)

source: This approach is most valuable if the new implementations must be used to use a particular package, as everyone interested in the package will need to have the new command implementation.
pl: To podejście jest najbardziej wartościowe jeśli nowe wypełnienia programowe muszą być użyte aby użyć konkretnego pakietu, jako że wszyscy zainteresowani tym pakietem będą potrzebowali dostać wypełnienie nowego polecenia.

source: Beginning with Python 2.4, a third option is available, intended to allow new commands to be added which can support existing :file:`setup.py` scripts without requiring modifications to the Python installation. This is expected to allow third-party extensions to provide support for additional packaging systems, but the commands can be used for anything distutils commands can be used for. A new configuration option, :option:`command_packages` (command-line option :option:`--command-packages`), can be used to specify additional packages to be searched for modules implementing commands. Like all distutils options, this can be specified on the command line or in a configuration file. This option can only be set in the ``[global]`` section of a configuration file, or before any commands on the command line. If set in a configuration file, it can be overridden from the command line; setting it to an empty string on the command line causes the default to be used. This should never be set in a configuration file provided with a package.
pl: Zaczynając od Pythona 2.4, trzecie wyjście jest możliwe, pomyślane aby pozwolić nowym poleceniom aby były dodawane co pomaga wspierać istniejące skrypty :file:`setup.py` bez potrzeby wprowadzania zmian do instalacji języka pytonowskiego. Oczekiwane jest umożliwienie rozszerzeniom pochodzącym od osób trzecich zapewnienie wsparcie dla dodatkowych systemów pakowania, ale polecenia mogą być używane dla dowolnej rzeczy do której polecenia distutils mogą być użyte. Nowa opcja konfiguracji, :option:`command_packages` (opcja wiersza-poleceń :option:`--command-packages`) może być użyta do określenia dodatkowych pakietów aby były przeszukiwane na obecność modułów wypełniających dane polecenie. Jak wszystkie opcje distutils, ta może być określona w wierszu poleceń jak i w pliku konfiguracyjnym. Ta opcja może tylko być ustawiona w rozdziale ``[global]`` ( - z ang. - ogólnym ) pliku konfiguracyjnego, lub zanim jakiekolwiek polecenia pojawią się w wierszu poleceń. Jeśli ustawiane w pliku konfiguracyjnym, można obejść to z wiersza poleceń; ustawienie tego na pusty ciąg znaków w wierszu poleceń powoduje użycie domyślnej wartości. Nie powinno być to ustawiane nigdy w pliku konfiguracyjnym dostarczonym w pakiecie.

source: This new option can be used to add any number of packages to the list of packages searched for command implementations; multiple package names should be separated by commas. When not specified, the search is only performed in the :mod:`distutils.command` package. When :file:`setup.py` is run with the option :option:`--command-packages` :option:`distcmds,buildcmds`, however, the packages :mod:`distutils.command`, :mod:`distcmds`, and :mod:`buildcmds` will be searched in that order. New commands are expected to be implemented in modules of the same name as the command by classes sharing the same name. Given the example command line option above, the command :command:`bdist_openpkg` could be implemented by the class :class:`distcmds.bdist_openpkg.bdist_openpkg` or :class:`buildcmds.bdist_openpkg.bdist_openpkg`.
pl: Ta nowa opcja może być używana aby dodać dowolną ilość pakietów do listy pakietów przeszukiwanych pod kątem wypełnień poleceń; wielokrotne nazwy pakietów powinny być rozdzielone przecinkami. Gdy nie określono poszukiwanie jest wykonywane tylko w pakiecie :mod:`distutils.command`. Gdy plik :file:`setup.py` jest uruchamiany z opcjami :option:`--command-packages` :option:`distcmds,buildcmds`, jednakże pakiety :mod:`distutils.command`, :mod:`distcmds`, i :mod:`buildcmds` będą przeszukiwane w tej kolejności. Oczekuje się że nowe polecenia będą wypełniane w modułach tej samej nazwy jak polecenie przez uogólnienia podzielające tę samą nazwę. Wziąwszy przykładowe opcje wiersza poleceń z powyżej, polecenie :command:`bdist_openpkg` mogłoby być wypełnione przez uogólnienie :class:`distcmds.bdist_openpkg.bdist_openpkg` lub :class:`buildcmds.bdist_openpkg.bdist_openpkg`

source: Adding new distribution types
pl: Dodawanie nowych rodzajów dystrybucji
